tests/stripe-messages/customer-object.json

{
    "id": "cus_LPOHmc865uyzX0",
    "object": "customer",
    "address": {
        "city": null,
        "country": "FR",
        "line1": null,
        "line2": null,
        "postal_code": "A94HD76",
        "state": null
    },
    "balance": 0,
    "created": 1648538965,
    "currency": "eur",
    "default_source": null,
    "delinquent": false,
    "description": null,
    "discount": null,
    "email": "customer@example.com",
    "invoice_prefix": "185C1CF5",
    "invoice_settings": {
        "custom_fields": null,
        "default_payment_method": null,
        "footer": null
    },
    "livemode": true,
    "metadata": {},
    "name": "Example Customer",
    "next_invoice_sequence": 2,
    "phone": null,
    "preferred_locales": [],
    "shipping": null,
    "sources": {
        "object": "list",
        "data": [],
        "has_more": false,
        "total_count": 0,
        "url": "/v1/customers/cus_LPOHmc865uyzX0/sources"
    },
    "subscriptions": {
        "object": "list",
        "data": [
            {
                "id": "sub_1KiZUYLEJyfuWvBBGaRbqZCq",
                "object": "subscription",
                "application_fee_percent": null,
                "automatic_tax": {
                    "enabled": false
                },
                "billing_cycle_anchor": 1648538966,
                "billing_thresholds": null,
                "cancel_at": null,
                "cancel_at_period_end": false,
                "canceled_at": null,
                "collection_method": "charge_automatically",
                "created": 1648538966,
                "current_period_end": 1651217366,
                "current_period_start": 1648538966,
                "customer": "cus_LPOHmc865uyzX0",
                "days_until_due": null,
                "default_payment_method": null,
                "default_source": null,
                "default_tax_rates": [],
                "discount": null,
                "ended_at": null,
                "items": {
                    "object": "list",
                    "data": [
                        {
                            "id": "si_LPOHc0qVddODNs",
                            "object": "subscription_item",
                            "billing_thresholds": null,
                            "created": 1648538966,
                            "metadata": {},
                            "plan": {
                                "id": "price_1KiZUYLEJyfuWvBBquygqsBj",
                                "object": "plan",
                                "active": false,
                                "aggregate_usage": null,
                                "amount": 500,
                                "amount_decimal": "500",
                                "billing_scheme": "per_unit",
                                "created": 1648538966,
                                "currency": "eur",
                                "interval": "month",
                                "interval_count": 1,
                                "livemode": true,
                                "metadata": {},
                                "nickname": null,
                                "product": "prod_K9Z8iM135HQLbv",
                                "tiers": null,
                                "tiers_mode": null,
                                "transform_usage": null,
                                "trial_period_days": null,
                                "usage_type": "licensed"
                            },
                            "price": {
                                "id": "price_1KiZUYLEJyfuWvBBquygqsBj",
                                "object": "price",
                                "active": false,
                                "billing_scheme": "per_unit",
                                "created": 1648538966,
                                "currency": "eur",
                                "livemode": true,
                                "lookup_key": null,
                                "metadata": {},
                                "nickname": null,
                                "product": "prod_K9Z8iM135HQLbv",
                                "recurring": {
                                    "aggregate_usage": null,
                                    "interval": "month",
                                    "interval_count": 1,
                                    "trial_period_days": null,
                                    "usage_type": "licensed"
                                },
                                "tax_behavior": "unspecified",
                                "tiers_mode": null,
                                "transform_quantity": null,
                                "type": "recurring",
                                "unit_amount": 500,
                                "unit_amount_decimal": "500"
                            },
                            "quantity": 1,
                            "subscription": "sub_1KiZUYLEJyfuWvBBGaRbqZCq",
                            "tax_rates": []
                        }
                    ],
                    "has_more": false,
                    "total_count": 1,
                    "url": "/v1/subscription_items?subscription=sub_1KiZUYLEJyfuWvBBGaRbqZCq"
                },
                "latest_invoice": "in_1KiZUYLEJyfuWvBB6S8Ewvf2",
                "livemode": true,
                "metadata": {},
                "next_pending_invoice_item_invoice": null,
                "pause_collection": null,
                "payment_settings": {
                    "payment_method_options": null,
                    "payment_method_types": null
                },
                "pending_invoice_item_interval": null,
                "pending_setup_intent": null,
                "pending_update": null,
                "plan": {
                    "id": "price_1KiZUYLEJyfuWvBBquygqsBj",
                    "object": "plan",
                    "active": false,
                    "aggregate_usage": null,
                    "amount": 500,
                    "amount_decimal": "500",
                    "billing_scheme": "per_unit",
                    "created": 1648538966,
                    "currency": "eur",
                    "interval": "month",
                    "interval_count": 1,
                    "livemode": true,
                    "metadata": {},
                    "nickname": null,
                    "product": "prod_K9Z8iM135HQLbv",
                    "tiers": null,
                    "tiers_mode": null,
                    "transform_usage": null,
                    "trial_period_days": null,
                    "usage_type": "licensed"
                },
                "quantity": 1,
                "schedule": null,
                "start_date": 1648538966,
                "status": "active",
                "tax_percent": null,
                "test_clock": null,
                "transfer_data": null,
                "trial_end": null,
                "trial_start": null
            }
        ],
        "has_more": false,
        "total_count": 1,
        "url": "/v1/customers/cus_LPOHmc865uyzX0/subscriptions"
    },
    "tax_exempt": "none",
    "tax_ids": {
        "object": "list",
        "data": [],
        "has_more": false,
        "total_count": 0,
        "url": "/v1/customers/cus_LPOHmc865uyzX0/tax_ids"
    },
    "test_clock": null
}