tests/stripe-messages/invoices-for-subscription.json

[
    {
        "id": "in_1KiZUYLEJyfuWvBB6S8Ewvf2",
        "object": "invoice",
        "account_country": "DE",
        "account_name": "WeMove Europe SCE mbH",
        "account_tax_ids": null,
        "amount_due": 500,
        "amount_paid": 500,
        "amount_remaining": 0,
        "application_fee_amount": null,
        "attempt_count": 1,
        "attempted": true,
        "auto_advance": false,
        "automatic_tax": {
            "enabled": false,
            "status": null
        },
        "billing_reason": "subscription_create",
        "charge": "ch_3KiZUYLEJyfuWvBB1sacQhek",
        "collection_method": "charge_automatically",
        "created": 1648538966,
        "currency": "eur",
        "custom_fields": null,
        "customer": "cus_LPOHmc865uyzX0",
        "customer_address": {
            "city": null,
            "country": "IE",
            "line1": null,
            "line2": null,
            "postal_code": "A94HD76",
            "state": null
        },
        "customer_email": "customer@example.com",
        "customer_name": "Example Customer",
        "customer_phone": null,
        "customer_shipping": null,
        "customer_tax_exempt": "none",
        "customer_tax_ids": [],
        "default_payment_method": null,
        "default_source": null,
        "default_tax_rates": [],
        "description": null,
        "discount": null,
        "discounts": [],
        "due_date": null,
        "ending_balance": 0,
        "footer": null,
        "hosted_invoice_url": "https://invoice.stripe.com/i/acct_16ExxKLEJyfuWvBB/live_YWNjdF8xNkV4eEtMRUp5ZnVXdkJCLF9MUE9IV2hCZlM2TGRpbDhCN3poRGZTdk1OaUVwZTByLDM5MTkxNjgx02009cJCVQm1?s=ap",
        "invoice_pdf": "https://pay.stripe.com/invoice/acct_16ExxKLEJyfuWvBB/live_YWNjdF8xNkV4eEtMRUp5ZnVXdkJCLF9MUE9IV2hCZlM2TGRpbDhCN3poRGZTdk1OaUVwZTByLDM5MTkxNjgx02009cJCVQm1/pdf?s=ap",
        "last_finalization_error": null,
        "lines": {
            "object": "list",
            "data": [
                {
                    "id": "il_1KiZUYLEJyfuWvBBzIfzpUDB",
                    "object": "line_item",
                    "amount": 500,
                    "currency": "eur",
                    "description": "1 × WeMove Donation (at €5.00 / month)",
                    "discount_amounts": [],
                    "discountable": true,
                    "discounts": [],
                    "livemode": true,
                    "metadata": {
                        "amount": "5",
                        "campaign": "3033",
                        "country": "IE",
                        "email": "customer@example.com",
                        "firstname": "Example",
                        "frequency": "monthly",
                        "initialAmount": "5",
                        "language": "en",
                        "lastname": "Customer",
                        "location": "https://act.wemove.eu/campaigns/3033",
                        "paymentMethod": "stripe",
                        "postcode": "A94HD76",
                        "speakoutCampaign": "3033",
                        "utm_campaign": "20220328_EN",
                        "utm_medium": "email",
                        "utm_source": "civimail-44406"
                    },
                    "period": {
                        "end": 1651217366,
                        "start": 1648538966
                    },
                    "plan": {
                        "id": "price_1KiZUYLEJyfuWvBBquygqsBj",
                        "object": "plan",
                        "active": false,
                        "aggregate_usage": null,
                        "amount": 500,
                        "amount_decimal": "500",
                        "billing_scheme": "per_unit",
                        "created": 1648538966,
                        "currency": "eur",
                        "interval": "month",
                        "interval_count": 1,
                        "livemode": true,
                        "metadata": {},
                        "nickname": null,
                        "product": "prod_K9Z8iM135HQLbv",
                        "tiers": null,
                        "tiers_mode": null,
                        "transform_usage": null,
                        "trial_period_days": null,
                        "usage_type": "licensed"
                    },
                    "price": {
                        "id": "price_1KiZUYLEJyfuWvBBquygqsBj",
                        "object": "price",
                        "active": false,
                        "billing_scheme": "per_unit",
                        "created": 1648538966,
                        "currency": "eur",
                        "livemode": true,
                        "lookup_key": null,
                        "metadata": {},
                        "nickname": null,
                        "product": "prod_K9Z8iM135HQLbv",
                        "recurring": {
                            "aggregate_usage": null,
                            "interval": "month",
                            "interval_count": 1,
                            "trial_period_days": null,
                            "usage_type": "licensed"
                        },
                        "tax_behavior": "unspecified",
                        "tiers_mode": null,
                        "transform_quantity": null,
                        "type": "recurring",
                        "unit_amount": 500,
                        "unit_amount_decimal": "500"
                    },
                    "proration": false,
                    "proration_details": {
                        "credited_items": null
                    },
                    "quantity": 1,
                    "subscription": "sub_1KiyVVLEJyfuWvBBwZcaE17e",
                    "subscription_item": "si_LPOHc0qVddODNs",
                    "tax_amounts": [],
                    "tax_rates": [],
                    "type": "subscription"
                }
            ],
            "has_more": false,
            "total_count": 1,
            "url": "/v1/invoices/in_1KiZUYLEJyfuWvBB6S8Ewvf2/lines"
        },
        "livemode": true,
        "metadata": {},
        "next_payment_attempt": null,
        "number": "185C1CF5-0001",
        "on_behalf_of": null,
        "paid": true,
        "paid_out_of_band": false,
        "payment_intent": "pi_3KiZUYLEJyfuWvBB1XPlRNNf",
        "payment_settings": {
            "payment_method_options": null,
            "payment_method_types": null
        },
        "period_end": 1648538966,
        "period_start": 1648538966,
        "post_payment_credit_notes_amount": 0,
        "pre_payment_credit_notes_amount": 0,
        "quote": null,
        "receipt_number": null,
        "starting_balance": 0,
        "statement_descriptor": null,
        "status": "paid",
        "status_transitions": {
            "finalized_at": 1648538966,
            "marked_uncollectible_at": null,
            "paid_at": 1648538997,
            "voided_at": null
        },
        "subscription": "sub_1KiyVVLEJyfuWvBBwZcaE17e",
        "subtotal": 500,
        "tax": null,
        "tax_percent": null,
        "test_clock": null,
        "total": 500,
        "total_discount_amounts": [],
        "total_tax_amounts": [],
        "transfer_data": null,
        "webhooks_delivered_at": 1648538969
    },
    {
        "id": "in_1KiZUYLEJyfuWvBB6S8Ewvf3",
        "object": "invoice",
        "account_country": "DE",
        "account_name": "WeMove Europe SCE mbH",
        "account_tax_ids": null,
        "amount_due": 500,
        "amount_paid": 500,
        "amount_remaining": 0,
        "application_fee_amount": null,
        "attempt_count": 1,
        "attempted": true,
        "auto_advance": false,
        "automatic_tax": {
            "enabled": false,
            "status": null
        },
        "billing_reason": "subscription_update",
        "charge": "ch_3KiZUYLEJyfuWvBB1sacQhej",
        "collection_method": "charge_automatically",
        "created": 1651130966,
        "currency": "eur",
        "custom_fields": null,
        "customer": "cus_LPOHmc865uyzX0",
        "customer_address": {
            "city": null,
            "country": "IE",
            "line1": null,
            "line2": null,
            "postal_code": "A94HD76",
            "state": null
        },
        "customer_email": "customer@example.com",
        "customer_name": "Example Customer",
        "customer_phone": null,
        "customer_shipping": null,
        "customer_tax_exempt": "none",
        "customer_tax_ids": [],
        "default_payment_method": null,
        "default_source": null,
        "default_tax_rates": [],
        "description": null,
        "discount": null,
        "discounts": [],
        "due_date": null,
        "ending_balance": 0,
        "footer": null,
        "hosted_invoice_url": "https://invoice.stripe.com/i/acct_16ExxKLEJyfuWvBB/live_YWNjdF8xNkV4eEtMRUp5ZnVXdkJCLF9MUE9IV2hCZlM2TGRpbDhCN3poRGZTdk1OaUVwZTByLDM5MTkxNjgx02009cJCVQm1?s=ap",
        "invoice_pdf": "https://pay.stripe.com/invoice/acct_16ExxKLEJyfuWvBB/live_YWNjdF8xNkV4eEtMRUp5ZnVXdkJCLF9MUE9IV2hCZlM2TGRpbDhCN3poRGZTdk1OaUVwZTByLDM5MTkxNjgx02009cJCVQm1/pdf?s=ap",
        "last_finalization_error": null,
        "lines": {
            "object": "list",
            "data": [
                {
                    "id": "il_1KiZUYLEJyfuWvBBzIfzpUDB",
                    "object": "line_item",
                    "amount": 500,
                    "currency": "eur",
                    "description": "1 × WeMove Donation (at €5.00 / month)",
                    "discount_amounts": [],
                    "discountable": true,
                    "discounts": [],
                    "livemode": true,
                    "metadata": {
                        "amount": "5",
                        "campaign": "3033",
                        "country": "IE",
                        "email": "customer@example.com",
                        "firstname": "Example",
                        "frequency": "monthly",
                        "initialAmount": "5",
                        "language": "en",
                        "lastname": "Customer",
                        "location": "https://act.wemove.eu/campaigns/3033",
                        "paymentMethod": "stripe",
                        "postcode": "A94HD76",
                        "speakoutCampaign": "3033",
                        "utm_campaign": "20220328_EN",
                        "utm_medium": "email",
                        "utm_source": "civimail-44406"
                    },
                    "period": {
                        "end": 1653809366,
                        "start": 1651130966
                    },
                    "plan": {
                        "id": "price_1KiZUYLEJyfuWvBBquygqsBj",
                        "object": "plan",
                        "active": false,
                        "aggregate_usage": null,
                        "amount": 500,
                        "amount_decimal": "500",
                        "billing_scheme": "per_unit",
                        "created": 1651130966,
                        "currency": "eur",
                        "interval": "month",
                        "interval_count": 1,
                        "livemode": true,
                        "metadata": {},
                        "nickname": null,
                        "product": "prod_K9Z8iM135HQLbv",
                        "tiers": null,
                        "tiers_mode": null,
                        "transform_usage": null,
                        "trial_period_days": null,
                        "usage_type": "licensed"
                    },
                    "price": {
                        "id": "price_1KiZUYLEJyfuWvBBquygqsBj",
                        "object": "price",
                        "active": false,
                        "billing_scheme": "per_unit",
                        "created": 1651130966,
                        "currency": "eur",
                        "livemode": true,
                        "lookup_key": null,
                        "metadata": {},
                        "nickname": null,
                        "product": "prod_K9Z8iM135HQLbv",
                        "recurring": {
                            "aggregate_usage": null,
                            "interval": "month",
                            "interval_count": 1,
                            "trial_period_days": null,
                            "usage_type": "licensed"
                        },
                        "tax_behavior": "unspecified",
                        "tiers_mode": null,
                        "transform_quantity": null,
                        "type": "recurring",
                        "unit_amount": 500,
                        "unit_amount_decimal": "500"
                    },
                    "proration": false,
                    "proration_details": {
                        "credited_items": null
                    },
                    "quantity": 1,
                    "subscription": "sub_1KiyVVLEJyfuWvBBwZcaE17e",
                    "subscription_item": "si_LPOHc0qVddODNs",
                    "tax_amounts": [],
                    "tax_rates": [],
                    "type": "subscription"
                }
            ],
            "has_more": false,
            "total_count": 1,
            "url": "/v1/invoices/in_1KiZUYLEJyfuWvBB6S8Ewvf3/lines"
        },
        "livemode": true,
        "metadata": {},
        "next_payment_attempt": null,
        "number": "185C1CF5-0001",
        "on_behalf_of": null,
        "paid": true,
        "paid_out_of_band": false,
        "payment_intent": "pi_3KiZUYLEJyfuWvBB1XPlRNNe",
        "payment_settings": {
            "payment_method_options": null,
            "payment_method_types": null
        },
        "period_end": 1653809366,
        "period_start": 1651130966,
        "post_payment_credit_notes_amount": 0,
        "pre_payment_credit_notes_amount": 0,
        "quote": null,
        "receipt_number": null,
        "starting_balance": 0,
        "statement_descriptor": null,
        "status": "paid",
        "status_transitions": {
            "finalized_at": 1651130966,
            "marked_uncollectible_at": null,
            "paid_at": 1648538997,
            "voided_at": null
        },
        "subscription": "sub_1KiyVVLEJyfuWvBBwZcaE17e",
        "subtotal": 500,
        "tax": null,
        "tax_percent": null,
        "test_clock": null,
        "total": 500,
        "total_discount_amounts": [],
        "total_tax_amounts": [],
        "transfer_data": null,
        "webhooks_delivered_at": 1648538969
    }
]