tests/stripe-messages/subscription.json

{
    "id": "sub_1KiyVVLEJyfuWvBBwZcaE17e",
    "object": "subscription",
    "application_fee_percent": null,
    "automatic_tax": {
        "enabled": false
    },
    "billing_cycle_anchor": 1648635125,
    "billing_thresholds": null,
    "cancel_at": null,
    "cancel_at_period_end": false,
    "canceled_at": null,
    "collection_method": "charge_automatically",
    "created": 1648635125,
    "current_period_end": 1651313525,
    "current_period_start": 1648635125,
    "customer": "cus_6ejnIamyd1dayr",
    "days_until_due": null,
    "default_payment_method": null,
    "default_source": null,
    "default_tax_rates": [],
    "discount": null,
    "ended_at": null,
    "items": {
        "object": "list",
        "data": [
            {
                "id": "si_LPo7v9cglitUI2",
                "object": "subscription_item",
                "billing_thresholds": null,
                "created": 1648635126,
                "metadata": {},
                "price": {
                    "id": "price_1J6ErRLEJyfuWvBBEnN3Y6La",
                    "object": "price",
                    "active": true,
                    "billing_scheme": "per_unit",
                    "created": 1624626861,
                    "currency": "eur",
                    "livemode": false,
                    "lookup_key": null,
                    "metadata": {},
                    "nickname": null,
                    "product": "prod_JjiIPD7pifRJMk",
                    "recurring": {
                        "aggregate_usage": null,
                        "interval": "month",
                        "interval_count": 1,
                        "usage_type": "licensed"
                    },
                    "tax_behavior": "unspecified",
                    "tiers_mode": null,
                    "transform_quantity": null,
                    "type": "recurring",
                    "unit_amount": 100,
                    "unit_amount_decimal": "100"
                },
                "quantity": 1,
                "subscription": "sub_1KiyVVLEJyfuWvBBwZcaE17e",
                "tax_rates": []
            }
        ],
        "has_more": false,
        "url": "/v1/subscription_items?subscription=sub_1KiyVVLEJyfuWvBBwZcaE17e"
    },
    "latest_invoice": null,
    "livemode": false,
    "metadata": {},
    "next_pending_invoice_item_invoice": null,
    "pause_collection": null,
    "payment_settings": {
        "payment_method_options": null,
        "payment_method_types": null
    },
    "pending_invoice_item_interval": null,
    "pending_setup_intent": null,
    "pending_update": null,
    "schedule": null,
    "start_date": 1648635125,
    "status": "active",
    "test_clock": null,
    "transfer_data": null,
    "trial_end": null,
    "trial_start": null
}